Revit 2026 API

# ScheduleDefinitionCanFilterByValuePresence Method

---

Checks whether a field can be used with a value presence-based filter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool CanFilterByValuePresence(
	ScheduleFieldId fieldId
)
```
```vb
Public Function CanFilterByValuePresence (
	fieldId As ScheduleFieldId
) As Boolean
```
```cpp
public:
bool CanFilterByValuePresence(
	ScheduleFieldId^ fieldId
)
```
```fsharp
member CanFilterByValuePresence :
        fieldId : ScheduleFieldId -> bool
```

#### Parameters

fieldId ScheduleFieldId
     The ID of the field to check.

#### Return Value

Boolean True if the field can be used with a value presence filter, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | fieldId is not the ID of a field in this ScheduleDefinition. |
| ArgumentNullException | A non-optional argument was null |

The value presence filter types are HasValue and HasNoValue.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace